#Область ПрограммныйИнтерфейс

// Выполняет валидацию составных частей Ф.И.О.
// Параметры:
//  текст - Строка - текст поля
//  этоФамилия - Булево - если Истрина проверка будет допускать возможность написания фамилии через дефис
// Возвращаемое значение:
//  Булево - если Истина содержимое текста прошло валидацию успешно
Функция ВалидацияПолейФио(Знач текст, Знач этоФамилия = Ложь) Экспорт
    шаблонПоиска = "^(?:[А-ЯЁ][а-яё]+)$";
    шаблонПоиска = ?(этоФамилия,
            Лев(шаблонПоиска, СтрДлина(шаблонПоиска) - 1) + "(?:\-[А-ЯЁ][а-яё]+)?$", шаблонПоиска);
    Возврат СтрПодобнаПоРегулярномуВыражению(текст, шаблонПоиска);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
