#Область ПрограммныйИнтерфейс

// Выполняет валидацию составных частей Ф.И.О.
// Параметры:
//  текст - Строка - текст поля
//  этоФамилия - Булево - если Истрина проверка будет допускать возможность написания фамилии через дефис
// Возвращаемое значение:
//  Булево - если Истина содержимое текста прошло валидацию успешно
Функция ВалидацияПолейФио(Знач текст, Знач этоФамилия = Ложь) Экспорт
    шаблонПоиска = "^(?:[А-ЯЁ][а-яё]+)$";
    шаблонПоиска = ?(этоФамилия,
            Лев(шаблонПоиска, СтрДлина(шаблонПоиска) - 1) + "(?:\-[А-ЯЁ][а-яё]+)?$", шаблонПоиска);
    Возврат СтрПодобнаПоРегулярномуВыражению(текст, шаблонПоиска);
КонецФункции

// Параметры:
//	имяСотрудника - Строка
// Возвращаемое значение:
//	- СправочникСсылка.Сотрудники
Функция НайтиСотрудникаПоИмени(Знач имяСотрудника) Экспорт
    запрос = Новый Запрос;
    запрос.Текст =
        "ВЫБРАТЬ
        |   Сотрудники.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.Сотрудники КАК Сотрудники
        |ГДЕ
        |   Сотрудники.ПометкаУдаления = ЛОЖЬ
        |   И Сотрудники.Наименование = &ИмяСотрудника
        |";
    запрос.УстановитьПараметр("ИмяСотрудника", имяСотрудника);
    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();
    Возврат выборка.Ссылка;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
