#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельПриИзменении(_)
    ЭтотОбъект.Объект.Наименование = сформироватьТекстНаименования();
КонецПроцедуры

&НаКлиенте
Процедура VINПриИзменении(_)
    ЭтотОбъект.Объект.Наименование = сформироватьТекстНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ГодВыпускаПриИзменении(_)
    ЭтотОбъект.Объект.ГодВыпуска = НачалоГода(ЭтотОбъект.Объект.ГодВыпуска);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция сформироватьТекстНаименования()
    модельНаименование = ЭтотОбъект.Объект.Модель;
    Возврат СтрШаблон("%1 (VIN: %2)", модельНаименование, ЭтотОбъект.Объект.VIN);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
