#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Структура, Неопределено
Функция ПолучитьТипыКонтрагентов() Экспорт
    Возврат РаботаСМетаданными.ПолучитьЗначенияПеречисления(Тип("ПеречислениеСсылка.ТипыКонтрагентов"));
КонецФункции

// Параметры:
//	ссылка - СправочникСсылка.Контрагенты, Произвольный
// Возвращаемое значение:
//	- ПеречислениеСсылка.ТипыКонтрагентов, Неопределено
Функция ПолучитьТипКонтрагента(Знач ссылка) Экспорт
    Если (НЕ ЗначениеЗаполнено(ссылка))
        ИЛИ ТипЗнч(ссылка) <> Тип("СправочникСсылка.Контрагенты") Тогда
        Возврат Неопределено;
    КонецЕсли;

    запросКонтрагента = Новый Запрос;
    запросКонтрагента.УстановитьПараметр("Ссылка", ссылка);

    запросКонтрагента.Текст =
        "ВЫБРАТЬ
        |	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
        |ИЗ
        |	Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |	Контрагенты.Ссылка = &Ссылка
        |";

    выборка = запросКонтрагента.Выполнить().Выбрать();
    Если выборка.Следующий() Тогда
        Возврат выборка.ТипКонтрагента;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции

// Параметры:
//	ссылка - СправочникСсылка.Контрагенты, Произвольный
// Возвращаемое значение:
//	- Булево
Функция ЭтотКонтрагентКлиент(Знач ссылка) Экспорт
    Возврат ПолучитьТипКонтрагента(ссылка) = Перечисления.ТипыКонтрагентов.Покупатель;
КонецФункции

// Параметры:
//	ссылка - СправочникСсылка.Контрагенты, Произвольный
// Возвращаемое значение:
//	- Булево
Функция ЭтотКонтрагентПоставщик(Знач ссылка) Экспорт
    Возврат ПолучитьТипКонтрагента(ссылка) = Перечисления.ТипыКонтрагентов.Поставщик;
КонецФункции

// Устарела.
// Параметры:
//	имяКлиента - Строка
// Возвращаемое значение:
//	- СправочникСсылка.Контрагенты
Функция НайтиКлиентаПоИмени(Знач имяКлиента) Экспорт
    запрос = Новый Запрос;
    запрос.Текст =
        "ВЫБРАТЬ
        |   Контрагенты.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |   Сотрудники.ПометкаУдаления = ЛОЖЬ
        |   И Сотрудники.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Покупатель)
        |   И Сотрудники.Наименование = &ИмяКлиента
        |";
    запрос.УстановитьПараметр("ИмяКлиента", имяКлиента);
    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();
    Возврат выборка.Ссылка;
КонецФункции

#КонецОбласти
