#Область ПрограммныйИнтерфейс

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   условие - Булево - если не равно Истина, то вызывается исключение.
//   сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//   контекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//
Процедура Утверждение(Знач условие, Знач сообщение = "", Знач контекстПроверки = "") Экспорт
    Если условие <> Истина Тогда
        Если ПустаяСтрока(сообщение) Тогда
            текстИсключения = НСтр("ru = 'Недопустимая операция'");
        Иначе
            текстИсключения = сообщение;
        КонецЕсли;

        Если НЕ ПустаяСтрока(контекстПроверки) Тогда
            текстИсключения = СтрШаблон(
                    НСтр("ru = '[ОТЛАДКА]: %1 в %2'"), текстИсключения, контекстПроверки);
        КонецЕсли;

        ВызватьИсключение текстИсключения;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
