#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвижения();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьВсеДвижения()
    Движения.Начисления.Записывать = Истина;
    //Движения.Хозрасчетный.Записывать = Истина;
    Движения.УчетЗатрат.Записывать = Истина;

    выполнитьДвиженияПоВсемНачислениям();
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();

    данныеНачислений = РегистрыРасчета.Начисления.ПолучитьДанныеНачисленийДокументаРегистратора(ЭтотОбъект.Ссылка, Истина);

    Для Каждого статьяЗатратНачисления Из данныеНачислений.НачисленияПоСтатьямЗатрат Цикл
        выполнитьДвижениеУчетЗатратОборот(статьяЗатратНачисления.СтатьяЗатрат, статьяЗатратНачисления.Сумма);
    КонецЦикла;

    //Для Каждого структураНачисления Из данныеНачислений.Начисления Цикл
    //    выполнитьДвижениеБУХозрасчетный(структураНачисления);
    //КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвиженияПоВсемНачислениям()
    Для Каждого строкаНачисления Из ЭтотОбъект.Начисления Цикл
        структураНачисления = РегистрыРасчета.Начисления.СоздатьПустуюСтруктуруНачисления();
        ЗаполнитьЗначенияСвойств(структураНачисления, строкаНачисления);

        РегистрыРасчета.Начисления.ЗаполнитьДвижениеНачисления(
            Движения.Начисления.Добавить(), ЭтотОбъект.ПериодНачисления, структураНачисления);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвижениеБУХозрасчетный(Знач структураНачисления)
    движение = РегистрыБухгалтерии.Хозрасчетный.ЗаполнитьДвижениеРасчетыСПерсоналом(
            Движения.Хозрасчетный.Добавить(), ЭтотОбъект.Дата,
            структураНачисления, "Отражено начисление заработной платы сотрудникам");
КонецПроцедуры

Процедура выполнитьДвижениеУчетЗатратОборот(Знач статьяЗатрат, Знач сумма)
    движение = Движения.УчетЗатрат.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.СтатьяЗатрат = статьяЗатрат;
    движение.Сумма = сумма;
КонецПроцедуры
#КонецОбласти // Движения

#КонецОбласти // СлужебныеПроцедурыИФункции
