#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
    инициализацияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(_)
    настроитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(_)
    настроитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область Инициализация

Процедура инициализацияНаСервере()
    ЭтотОбъект._Состояние = Новый Структура;
    ЭтотОбъект._Состояние.Вставить("ТипыОрганизаций",
        РаботаСМетаданными.ПолучитьЗначенияПеречисления(Тип("ПеречислениеСсылка.ТипыОрганизаций")));
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(ЭтотОбъект._Состояние.ТипыОрганизаций, Ложь));
КонецПроцедуры

#КонецОбласти // Инициализация

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура настроитьВидимостьЭлементовФормы()
    этоЮридическоеЛицо = ЭтотОбъект.Объект.ТипОрганизации = ЭтотОбъект._Состояние.ТипыОрганизаций.ЮридическоеЛицо;
    ЭтотОбъект.Элементы.ГлавныйБухгалтер.Видимость = этоЮридическоеЛицо;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
