#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(отказ, __)
    Если ЭтотОбъект.Товары.Количество() = 0 И ЭтотОбъект.Услуги.Количество() = 0 Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = "Документ должен содержать не менее одной записи номенклатуры товаров или услуг.";
        сообщение.Сообщить();

        отказ = Истина;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвиженияДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьВсеДвиженияДокумента()
    ЭтотОбъект.Движения.ТоварыНаСкладах.Записывать = Истина;
    ЭтотОбъект.Движения.УчетЗатрат.Записывать = Истина;
    ЭтотОбъект.Движения.Хозрасчетный.Записывать = Истина;

    выполнитьВсеДвиженияТоваровДокумента();
    выполнитьВсеДвиженияУслугДокумента();
КонецПроцедуры

Процедура выполнитьВсеДвиженияТоваровДокумента()
    отражатьСрокиГодности = получитьУчетнуюПолитику() = Перечисления.СпособыСписанияЗапасов.FEFO;

    таблицаТоварыДокумента = Документы.ПоступлениеТоваровИУслуг.ПолучитьТоварыДокумента(
            ЭтотОбъект.Ссылка, отражатьСрокиГодности, Истина);
    Если таблицаТоварыДокумента = Неопределено Тогда
        ДиагностикаКлиентСервер.Утверждение(ЭтотОбъект.Товары.Количество() = 0,
                "Ожидается что ТЧ Товары должна быть пустой.");
        Возврат;
    КонецЕсли;

    Для Каждого строкаТоваров Из таблицаТоварыДокумента Цикл
        выполнитьДвижениеТоварыНаСкладахПриход(строкаТоваров, отражатьСрокиГодности);
        РегистрыБухгалтерии.Хозрасчетный.ДобавитьЗаписьПоступлениеТМЦ(
            ЭтотОбъект.Дата, ЭтотОбъект.Движения.Хозрасчетный, строкаТоваров, ЭтотОбъект.Контрагент);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьВсеДвиженияУслугДокумента()
    таблицаУслуг = Документы.ПоступлениеТоваровИУслуг.ПолучитьУслугиДокумента(
            ЭтотОбъект.Ссылка, Истина);

    Для Каждого строкаУслуг Из таблицаУслуг Цикл
        РегистрыБухгалтерии.Хозрасчетный.ДобавитьЗаписьПоступлениеУслуг(
            ЭтотОбъект.Дата, ЭтотОбъект.Движения.Хозрасчетный, строкаУслуг, ЭтотОбъект.Контрагент);
    КонецЦикла;

    таблицаУслуг.Свернуть("СтатьяЗатрат", "Сумма");
    таблицаСтатьиЗатрат = таблицаУслуг;
    Для Каждого строкаЗатрат Из таблицаСтатьиЗатрат Цикл
        выполнитьДвижениеУчетЗатратОборот(строкаЗатрат);
    КонецЦикла;
КонецПроцедуры

// Параметры:
//  строкаТоваров - СтрокаТаблицыЗначений, Структура
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
//      * Сумма - Число
//      * СрокГодности - Дата, Неопределено - [Опционально] Если `отражатьСрокиГодности` = Ложь значение игнорируется
//  отражатьСрокиГодности - Булево - Если Ложь, `СрокГодности` игнорируется
Процедура выполнитьДвижениеТоварыНаСкладахПриход(Знач строкаТоваров, Знач отражатьСрокиГодности = Ложь)
    движение = ЭтотОбъект.Движения.ТоварыНаСкладах.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    движение.Период = ЭтотОбъект.Дата;
    движение.Номенклатура = строкаТоваров.Номенклатура;
    движение.Склад = ЭтотОбъект.Склад;
    движение.Количество = строкаТоваров.Количество;
    движение.Сумма = строкаТоваров.Сумма;
    Если отражатьСрокиГодности Тогда
        движение.СрокГодности = строкаТоваров.СрокГодности;
    КонецЕсли;
КонецПроцедуры

// Параметры:
//  строкаЗатрат - СтрокаТаблицыЗначений, Структура
//      * СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат
//      * Сумма - Число
Процедура выполнитьДвижениеУчетЗатратОборот(Знач строкаЗатрат)
    движение = ЭтотОбъект.Движения.УчетЗатрат.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.СтатьяЗатрат = строкаЗатрат.СтатьяЗатрат;
    движение.Сумма = строкаЗатрат.Сумма;
КонецПроцедуры
#КонецОбласти // Движения

// Возвращаемое значение:
//  - ПеречислениеСсылка.СпособыСписанияЗапасов
Функция получитьУчетнуюПолитику()
    Возврат РегистрыСведений.УчетнаяПолитика.ПолучитьТекущийСпособСписанияЗапасов(ЭтотОбъект.Дата);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
