#Область ПрограммныйИнтерфейс

Функция ЗаполнитьДвижениеРасчетыСПерсоналом(Знач движение, Знач дата, Знач структураНачисления, Знач содержание) Экспорт
    движение.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
    движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
    движение.Период = дата;
    движение.Сумма = структураНачисления.Сумма;
    движение.Содержание = содержание;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(движение.СчетДт,
        движение.СубконтоДт, структураНачисления.СтатьяЗатрат);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(движение.СчетКт,
        движение.СубконтоКт, структураНачисления.Сотрудник);

    Возврат движение;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
