#Область СлужебныеПроцедурыИФункции

#Область User
#Область GET
Функция User_ПолучитьПользователя(запрос)
    телоОтвета = Новый Структура("Успех, Пользователь, Сообщение", Истина);
    ответ = Новый HTTPСервисОтвет(200);
    ответ.Заголовки.Вставить("Content-type", "application/json");

    имяПользователя = запрос.ПараметрыЗапроса.Получить("name");
    Если ТипЗнч(имяПользователя) <> Тип("Строка") ИЛИ ПустаяСтрока(имяПользователя) Тогда
        ответ.КодСостояния = 400;
        телоОтвета.Сообщение = "Не указано имя пользователя.";
        ответ.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(телоОтвета));

        Возврат ответ;
    КонецЕсли;

    пользовательПриложения = найтиПользователя(имяПользователя);
    Если пользовательПриложения = Неопределено Тогда
        телоОтвета.Успех = Ложь;
        телоОтвета.Сообщение = "Пользователь не найден.";
    КонецЕсли;

    телоОтвета.Пользователь = пользовательПриложения;
    ответ.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(телоОтвета));

    Возврат ответ;
КонецФункции
#КонецОбласти // GET

#Область POST
Функция User_СоздатьПользователя(запрос)
    телоОтвета = Новый Структура("Успех, Пользователь, Сообщение", Истина);
    ответ = Новый HTTPСервисОтвет(200);
    ответ.Заголовки.Вставить("Content-type", "application/json");

    имяПользователя = запрос.ПараметрыЗапроса.Получить("name");
    Если ТипЗнч(имяПользователя) <> Тип("Строка") ИЛИ ПустаяСтрока(имяПользователя) Тогда
        ответ.КодСостояния = 400;
        телоОтвета.Сообщение = "Не указано имя пользователя.";
        ответ.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(телоОтвета));

        Возврат ответ;
    КонецЕсли;

    пользовательПриложения = найтиПользователя(имяПользователя);
    Если пользовательПриложения <> Неопределено Тогда // Пользователь существует
        телоОтвета.Успех = Ложь;
        телоОтвета.Сообщение = СтрШаблон(
                "Неправильное имя пользователя. Пользователь с именем ""%1"" уже существует в базе.",
                имяПользователя);

    Иначе // Создание нового пользователя
        новыйПользователь = создатьПользователя(имяПользователя);
        пользовательПриложения.Имя = новыйПользователь.Наименование;
        пользовательПриложения.УникальныйИдентификатор = новыйПользователь.Код;

    КонецЕсли;

    телоОтвета.Пользователь = пользовательПриложения;
    ответ.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(телоОтвета));

    Возврат ответ;
КонецФункции
#КонецОбласти // POST
#КонецОбласти // User

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункции

Функция найтиПользователя(Знач имяПользователя)
    результатПоискаПользователя = Справочники.Пользователи.НайтиПользователяПоИмени(имяПользователя);
    Если результатПоискаПользователя = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    пользовательПриложения = РаботаСРеквизитами.ЗначенияРеквизитовОбъекта(
            результатПоискаПользователя.Ссылка, Новый Структура("Наименование, Код", "Имя", "УникальныйИдентификатор"));

    Возврат пользовательПриложения;
КонецФункции

Функция создатьПользователя(Знач имяПользователя)
    Возврат Справочники.Пользователи.СоздатьПользователя(
        имяПользователя, Неопределено, Неопределено, Истина);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
