#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвиженияДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьВсеДвиженияДокумента()
    Движения.МатериалыЗаказчиков.Записывать = Истина;
    Движения.ЗаказыКлиентов.Записывать = Истина;

    выполнитьВсеДвиженияМатериалыЗаказчиков();
    выполнитьВсеДвиженияЗаказыКлиентов();
КонецПроцедуры

Процедура выполнитьВсеДвиженияМатериалыЗаказчиков()
    Для Каждого строкаМатериалЗаказчика Из ЭтотОбъект.МатериалыЗаказчика Цикл
        выполнитьДвижениеМатериалыЗаказчиковПриход(ЭтотОбъект.Дата, ЭтотОбъект.Склад, ЭтотОбъект.Клиент, строкаМатериалЗаказчика);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвижениеМатериалыЗаказчиковПриход(Знач период, Знач склад, Знач заказчик, Знач материалЗаказчика)
    движение = Движения.МатериалыЗаказчиков.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    движение.Период = период;
    движение.Склад = склад;
    движение.Заказчик = заказчик;
    движение.Номенклатура = материалЗаказчика.Номенклатура;
    движение.Количество = материалЗаказчика.Количество;
    движение.Количество = материалЗаказчика.Количество;
КонецПроцедуры

Процедура выполнитьВсеДвиженияЗаказыКлиентов()
    выполнитьДвижениеЗаказыКлиентовПриход(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка, ЭтотОбъект.Клиент, ЭтотОбъект.СуммаДокумента);
КонецПроцедуры

Процедура выполнитьДвижениеЗаказыКлиентовПриход(Знач период, Знач документСсылка, Знач клиент, Знач сумма)
    движение = Движения.ЗаказыКлиентов.Добавить();
    движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    движение.Период = период;
    движение.Клиент = клиент;
    движение.ЗаказКлиента = документСсылка;
    движение.Сумма = сумма;
КонецПроцедуры
#КонецОбласти // Движения

#КонецОбласти // СлужебныеПроцедурыИФункции
