#Область ПрограммныйИнтерфейс

// Параметры:
//  период - Дата, МоментВремени, Граница, Неопределено
// Возвращаемое значение:
//  - ПеречислениеСсылка.СпособыСписанияЗапасов
Функция ПолучитьТекущийСпособСписанияЗапасов(Знач период = Неопределено) Экспорт
    учетнаяПолитикаОрганизации = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(период);
    ДиагностикаКлиентСервер.Утверждение(ЗначениеЗаполнено(учетнаяПолитикаОрганизации),
        "Не установлена учетная политика организации.
        |Учетная политика должна быть установлена до начала использования ИБ.");

    способСписанияЗапасов = учетнаяПолитикаОрганизации.УчетнаяПолитика;
    ДиагностикаКлиентСервер.Утверждение(учетнаяПолитикаОрганизации <> Неопределено,
        "Не установлен способ списания запасов для организации.
        |способ списания запасов должен быть установлен до начала использования ИБ.");

    Возврат способСписанияЗапасов;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
