#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    выполнитьВсеДвижения();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Процедура выполнитьВсеДвижения()
    // Движения по регистру Начисления
    выполнитьВсеДвиженияНачислений();
    Движения.Начисления.Записывать = Истина;
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();

    // Движения по регистру УчетЗатрат
    Движения.УчетЗатрат.Записывать = Истина;
    данныеНачислений = РегистрыРасчета.Начисления.ПолучитьДанныеНачисленийДокумента(ЭтотОбъект.Ссылка, Истина);
    Для Каждого статьяЗатратНачисления Из данныеНачислений.НачисленияПоСтатьямЗатрат Цикл
        выполнитьДвижениеУчетЗатратОборот(статьяЗатратНачисления.статьяЗатрат, статьяЗатратНачисления.Сумма);
    КонецЦикла;

    // Движения по регистру Хозрасчетный
    //Движения.Хозрасчетный.Записывать = Истина;
    //Для Каждого структураНачисления Из данныеНачислений.Начисления Цикл
    //    выполнитьДвижениеБУХозрасчетный(структураНачисления);
    //КонецЦикла;
КонецПроцедуры

Процедура выполнитьВсеДвиженияНачислений()
    Для Каждого строкаНачисления Из ЭтотОбъект.Начисления Цикл
        структураНачисления = РегистрыРасчета.Начисления.СоздатьПустуюСтруктуруНачисления();

        ЗаполнитьЗначенияСвойств(структураНачисления, строкаНачисления);
        структураНачисления.ДатаНачала = НачалоМесяца(ЭтотОбъект.ПериодНачисления);
        структураНачисления.ДатаОкончания = КонецМесяца(ЭтотОбъект.ПериодНачисления);

        РегистрыРасчета.Начисления.ЗаполнитьДвижениеНачисления(
            Движения.Начисления.Добавить(), ЭтотОбъект.ПериодНачисления, структураНачисления);
    КонецЦикла;
КонецПроцедуры

//Процедура выполнитьДвижениеБУХозрасчетный(Знач структураНачисления)
//    движение = РегистрыБухгалтерии.Хозрасчетный.ЗаполнитьДвижениеРасчетыСПерсоналом(
//            Движения.Хозрасчетный.Добавить(), ЭтотОбъект.Дата,
//            структураНачисления, "Отражено начисление премии сотрудникам");
//КонецПроцедуры

Процедура выполнитьДвижениеУчетЗатратОборот(Знач статьяЗатрат, Знач сумма)
    движение = Движения.УчетЗатрат.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.СтатьяЗатрат = статьяЗатрат;
    движение.Сумма = сумма;
КонецПроцедуры
#КонецОбласти // Движения

#КонецОбласти // СлужебныеПроцедурыИФункции
