#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    проверенныеРеквизиты = Новый Массив();
    Если проверитьЗаполнениеРодителя() = Ложь Тогда
        проверенныеРеквизиты.Добавить("Родитель");
        отказ = Истина;

    Иначе // Проверка соответствия типа группе номенклатуры
        группаНоменклатуры = Справочники.Номенклатура.ПолучитьТипНоменклатурыПоГруппе(ЭтотОбъект.Родитель);
        Если группаНоменклатуры <> ЭтотОбъект.ТипНоменклатуры Тогда
            имяРеквизитаТипНоменклатуры = "ТипНоменклатуры";

            сообщение = Новый СообщениеПользователю;
            сообщение.Текст = "Указанный тип номенклатуры не соответствует группе номенклатуры.";
            сообщение.Поле = имяРеквизитаТипНоменклатуры;
            сообщение.УстановитьДанные(ЭтотОбъект);
            сообщение.Сообщить();

            проверенныеРеквизиты.Добавить(имяРеквизитаТипНоменклатуры);
            отказ = Истина;
        КонецЕсли;
    КонецЕсли;

    РаботаСРеквизитами.ИсключитьПроверенныеРеквизиты(проверенныеРеквизиты, проверяемыеРеквизиты);

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Функция проверитьЗаполнениеРодителя()
    Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) = Ложь Тогда
        имяРеквизита = "Родитель";
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = СтрШаблон("Поле ""%1"" должно быть заполнено заполнено.", имяРеквизита);
        сообщение.Поле = имяРеквизита;
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();

        Возврат Ложь;
    КонецЕсли;

    Возврат Истина;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
