Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    непроверяемыеРеквизиты = Новый Массив();

    // Проверка соответствия типа группе номенклатуры
    Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
        группаНоменклатуры = Справочники.Номенклатура.ПолучитьТипНоменклатурыПоГруппе(ЭтотОбъект.Родитель);
        Если группаНоменклатуры <> ЭтотОбъект.ТипНоменклатуры Тогда
            имяРеквизитаТипНоменклатуры = "ТипНоменклатуры";

            сообщение = Новый СообщениеПользователю;
            сообщение.Текст = "Указанный тип номенклатуры не соответствует группе номенклатуры.";
            сообщение.Поле = имяРеквизитаТипНоменклатуры;
            сообщение.УстановитьДанные(ЭтотОбъект);
            сообщение.Сообщить();

            непроверяемыеРеквизиты.Добавить(имяРеквизитаТипНоменклатуры);
            Отказ = Истина;
        КонецЕсли;
    КонецЕсли;

    исключитьНепроверяемыеРеквизитыИзМассива(непроверяемыеРеквизиты, ПроверяемыеРеквизиты);

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура исключитьНепроверяемыеРеквизитыИзМассива(Знач массивНепроверяемыхРеквизитов, Знач массивРеквизитов) Экспорт
    Для Каждого элементМассива Из массивНепроверяемыхРеквизитов Цикл
        ПорядковыйНомер = массивРеквизитов.Найти(элементМассива);
        Если ПорядковыйНомер <> Неопределено Тогда
            массивРеквизитов.Удалить(ПорядковыйНомер);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
