#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(Знач именаПараметровСеанса)
    Если именаПараметровСеанса = Неопределено ИЛИ именаПараметровСеанса.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    установленныеПараметры = Новый Структура;
    Для Каждого имяПараметра Из именаПараметровСеанса Цикл
        Если установленныеПараметры.Свойство(имяПараметра) Тогда
            Продолжить;
        КонецЕсли;

        установленноеЗначение = установитьЗначениеПараметраСеанса(имяПараметра);
        установленныеПараметры.Вставить(имяПараметра, установленноеЗначение);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Функция установитьЗначениеПараметраСеанса(Знач имяПараметра)
    Если имяПараметра = "ТекущийПользователь" Тогда
        пользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();

        Если пользовательИБ = Неопределено Тогда
            Возврат Неопределено;
        КонецЕсли;

        текущийПользователь = Справочники.Пользователи.НайтиПоКоду(пользовательИБ.УникальныйИдентификатор);

        Если текущийПользователь.Пустая() Тогда
            текущийПользователь = Справочники.Пользователи.СоздатьПользователя(пользовательИБ.Имя, пользовательИБ.УникальныйИдентификатор);
        КонецЕсли;

        ПараметрыСеанса.ТекущийПользователь = текущийПользователь;

        Возврат ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
