#Область ПрограммныйИнтерфейс

// Функция обертка для "ЗаменитьПоРегулярномуВыражению".\
// Используется для вызова на стороне клиента
//
// Параметры:
//  исходнаяСтрока - Строка - исходная строка
//  выражение - Строка - выражение для поиска
//  подстрокаЗамены - Строка - подстрока замены
//  игнорироватьРегистр - Булево - по умолчанию = Ложь
//
// Возвращаемое значение:
//  Строка
Функция ЗаменитьПоРегулярномуВыражению(Знач исходнаяСтрока, Знач выражение,
        Знач подстрокаЗамены, Знач игнорироватьРегистр = Ложь) Экспорт
    Возврат СтрЗаменитьПоРегулярномуВыражению(исходнаяСтрока, выражение, подстрокаЗамены, игнорироватьРегистр);
КонецФункции

// Функция обертка для "СтрПодобнаПоРегулярномуВыражению".\
// Используется для вызова на стороне клиента.\
// Проверяет, соответствует ли передаваемая строка передаваемому шаблону исходного выражения.
//
// Параметры:
//  исходнаяСтрока - Строка - исходная строка
//  выражение - Строка - выражение для поиска
//  игнорироватьРегистр - Булево - по умолчанию = Ложь
//  многострочныйПоиск - Булево - по умолчанию = Ложь
//
// Возвращаемое значение:
//  Булево
Функция ПодобнаПоРегулярномуВыражению(Знач исходнаяСтрока, Знач выражение,
        Знач игнорироватьРегистр = Ложь, Знач многострочныйПоиск = Ложь) Экспорт
    Возврат СтрПодобнаПоРегулярномуВыражению(исходнаяСтрока, выражение, игнорироватьРегистр, многострочныйПоиск);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
