#Область ПрограммныйИнтерфейс

// Возвращает остатки по списку **Номенклатуры** из регистра **ТоварыНаСкладах**
// Параметры:
//  списокНоменклатуры - ФиксированныйМассив, Массив из СправочникСсылка.Номенклатура
//  период - Дата, МоментВремени, Граница, Неопределено
//  выгрузить - Булево
// Возвращаемое значение:
//  - ТаблицаЗначений - Если **выгрузить** = Истина
//  - ВыборкаИзРезультатаЗапроса - Если **выгрузить** = Ложь
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Склад - СправочникСсылка.Склады
//      * СрокГодности - Дата
//      * Количество - Число
//      * Сумма - Число
Функция ПолучитьОстаткиНоменклатуры(Знач списокНоменклатуры, Знач период = Неопределено, Знач выгрузить = Истина) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоМассив(списокНоменклатуры, Ложь),
        "Список номенклатуры должен иметь Тип ""[Фиксированный]Массив"".");

    запрос = Новый Запрос;
    запрос.УстановитьПараметр("Номенклатура", списокНоменклатуры);
    запрос.Текст =
        "ВЫБРАТЬ
        |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
        |	ТоварыНаСкладахОстатки.Склад КАК Склад,
        |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
        |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
        |	ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
        |ИЗ
        |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, Номенклатура В (&Номенклатура)) КАК ТоварыНаСкладахОстатки
        |";

    Если период = Неопределено Тогда
        запрос.Текст = СтрЗаменить(запрос.Текст, "&Период, ", "");
    Иначе
        запрос.УстановитьПараметр("Период", период);
    КонецЕсли;

    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
