#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Знач данныеЗаполнения, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;

    Если ТипЗнч(данныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
        заполнитьНаОснованииДокументаЗакаНаряд(данныеЗаполнения);
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(отказ, __)
    очиститьДвиженияДокумента();

    результатВыполненияДвижений = выполнитьВсеДвиженияДокумента();
    Если результатВыполненияДвижений.Успех = Ложь Тогда
        отказ = Истина;
    Иначе
        записатьДвижения();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции
#Область Движения
Процедура записатьДвижения()
    Движения.ТоварыНаСкладах.Записывать = Истина;
    Движения.Продажи.Записывать = Истина;
    Движения.УчетЗатрат.Записывать = Истина;

    Движения.Записать();
КонецПроцедуры

Процедура очиститьДвиженияДокумента()
    записатьДвижения();
    Движения.ЗаказыКлиентов.Записывать = Истина;
КонецПроцедуры

Функция выполнитьВсеДвиженияДокумента()
    результатДвижений = Новый Структура("Успех", Истина);

    результатДвижений.Успех = выполнитьВсеДвиженияТоваровДокумента().Успех;
    Если результатДвижений.Успех = Ложь Тогда
        Возврат результатДвижений;
    КонецЕсли;

    выполнитьВсеДвиженияУслугДокумента();

    Возврат результатДвижений;
КонецФункции

Функция выполнитьВсеДвиженияТоваровДокумента()
    результатДвижения = Новый Структура("Успех", Истина);

    менеджерТаблиц = Новый МенеджерВременныхТаблиц;

    блокировка = получитьБлокировкуИзмененияТоварыНаСкладах();
    блокировка.Заблокировать();

    выборкаПартияНоменклатуры = получитьТоварыДокументаИОстатки(менеджерТаблиц);
    Если выборкаПартияНоменклатуры = Неопределено Тогда
        Возврат результатДвижения;
    КонецЕсли;

    Пока выборкаПартияНоменклатуры.Следующий() Цикл
        количествоОстатков = выборкаПартияНоменклатуры.КоличествоОстаток - выборкаПартияНоменклатуры.КоличествоВДокументе;

        Если количествоОстатков < 0 Тогда
            сообщитьПользователюОПревышенииОстатков(
                -количествоОстатков,
                выборкаПартияНоменклатуры.НоменклатураПредставление);

            результатДвижения.Успех = Ложь;
        КонецЕсли;

        Если результатДвижения.Успех Тогда
            стоимостьПартии = выполнитьДвиженияПоПартииТоваров(выборкаПартияНоменклатуры);
            выполнитьДвижениеУчетЗатратОборот(выборкаПартияНоменклатуры.СтатьяЗатрат, стоимостьПартии);

            выполнитьДвижениеПродажиОборот(выборкаПартияНоменклатуры.Номенклатура,
                выборкаПартияНоменклатуры.СуммаВДокументе, выборкаПартияНоменклатуры.количествоВДокументе);
        КонецЕсли;
    КонецЦикла;

    Возврат результатДвижения;
КонецФункции

Процедура выполнитьВсеДвиженияУслугДокумента()
    услугиДокумента = получитьУслугиДокумента();
    Если услугиДокумента = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для Каждого строкаУслуг Из услугиДокумента Цикл
        выполнитьДвижениеПродажиОборот(строкаУслуг.Номенклатура, строкаУслуг.Сумма, строкаУслуг.Количество);
    КонецЦикла;
КонецПроцедуры

Процедура выполнитьДвижениеПродажиОборот(Знач номенклатура, Знач сумма, Знач количество)
    движение = Движения.Продажи.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.Номенклатура = номенклатура;
    движение.Сотрудник = ЭтотОбъект.Сотрудник;
    движение.Контрагент = ЭтотОбъект.Контрагент;
    движение.Количество = количество;
    движение.Сумма = сумма;
КонецПроцедуры

Функция выполнитьДвиженияПоПартииТоваров(Знач выборкаНоменклатураДокумента)
    общаяСтоимостьНоменклатуры = 0;
    несписанныйОстаток = выборкаНоменклатураДокумента.КоличествоВДокументе;

    выборкаНоменклатураДокументаПоСрокуГодности = выборкаНоменклатураДокумента.Выбрать();
    Пока выборкаНоменклатураДокументаПоСрокуГодности.Следующий() И несписанныйОстаток > 0 Цикл
        // Выполняем проводку по регистру ТоварыНаСкладах для партии товаров
        результатСписания = выполнитьДвижениеТоварыНаСкладахРасход(
                выборкаНоменклатураДокументаПоСрокуГодности,
                несписанныйОстаток);

        общаяСтоимостьНоменклатуры = общаяСтоимостьНоменклатуры + результатСписания.Сумма;
        несписанныйОстаток = несписанныйОстаток - результатСписания.Количество;
    КонецЦикла;

    Возврат общаяСтоимостьНоменклатуры;
КонецФункции

// Параметры:
//  выборкаТоварыПоПартиям - Выборка - выборка товаров на складе с группировкой по сроку годности
//  текущийОстатокВДокументе - Число - Остаток количества Номенклатуры (Товаров) в документе
//  этоОтрицательныйОстаток - Булево - Указывает закончились ли товары на складе
// Возвращаемое значение:
//  - Структура - { Сумма: Число - Стоимость выполненного списания по партии Товаров, Количество: Число - Количество выполненного списания }
Функция выполнитьДвижениеТоварыНаСкладахРасход(выборкаТоварыПоПартиям,
        Знач текущийОстатокВДокументе, Знач этоОтрицательныйОстаток = Ложь)

    доступноДляСписания = ?(этоОтрицательныйОстаток, текущийОстатокВДокументе,
            Мин(выборкаТоварыПоПартиям.КоличествоОстаток, текущийОстатокВДокументе));

    движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
    движение.Период = Дата;
    движение.Номенклатура = выборкаТоварыПоПартиям.Номенклатура;
    движение.Склад = ЭтотОбъект.Склад;
    движение.СрокГодности = выборкаТоварыПоПартиям.СрокГодности;
    движение.Количество = доступноДляСписания;
    Если доступноДляСписания = выборкаТоварыПоПартиям.КоличествоОстаток ИЛИ этоОтрицательныйОстаток Тогда
        движение.Сумма = выборкаТоварыПоПартиям.СуммаОстаток;
    Иначе
        движение.Сумма = доступноДляСписания / выборкаТоварыПоПартиям.КоличествоОстаток
            * выборкаТоварыПоПартиям.СуммаОстаток;
    КонецЕсли;

    результатСписания = Новый Структура("Сумма, Количество", движение.Сумма, движение.Количество);

    Возврат результатСписания;
КонецФункции

Процедура выполнитьДвижениеУчетЗатратОборот(Знач статьяЗатрат, Знач сумма)
    движение = Движения.УчетЗатрат.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.СтатьяЗатрат = статьяЗатрат;
    движение.Сумма = сумма;
КонецПроцедуры
#КонецОбласти // Движения

#Область ЗаполнениеНаОсновании
Процедура заполнитьНаОснованииДокументаЗакаНаряд(Знач документСсылка)
    ДиагностикаКлиентСервер.Утверждение(ТипЗнч(документСсылка) = Тип("ДокументСсылка.ЗаказНаряд"));
    ДиагностикаКлиентСервер.Утверждение(ЗначениеЗаполнено(документСсылка),
        "Для заполнения на основании документ должен иметь не пустую ссылку.");

    ЭтотОбъект.ДокументОснование = документСсылка;
    ЭтотОбъект.Контрагент = документСсылка.Клиент;
    ЭтотОбъект.Автомобиль = документСсылка.Автомобиль;
    ЭтотОбъект.Сотрудник = документСсылка.Сотрудник;
    ЭтотОбъект.Комментарий = документСсылка.Комментарий;
    ЭтотОбъект.СуммаДокумента = документСсылка.СуммаДокумента;

    // Заполнение ТЧ Услуги
    ДиагностикаКлиентСервер.Утверждение(ЭтотОбъект.Услуги.Количество() = 0,
            "Таблица Услуги должна быть пустой");
    копироватьТЧ(ЭтотОбъект.Услуги, документСсылка.Услуги);

    // Заполнение ТЧ МатериалыЗаказчика
    ДиагностикаКлиентСервер.Утверждение(ЭтотОбъект.МатериалыЗаказчика.Количество() = 0,
            "Таблица МатериалыЗаказчика должна быть пустой");
    копироватьТЧ(ЭтотОбъект.МатериалыЗаказчика, документСсылка.МатериалыЗаказчика);

КонецПроцедуры

Процедура копироватьТЧ(Знач таблицаПриемник, Знач таблицаИсточник)
    Для Каждого строкаУслугИсточник Из таблицаИсточник Цикл
        новаяСтрокаУслуг = таблицаПриемник.Добавить();
        ЗаполнитьЗначенияСвойств(новаяСтрокаУслуг, строкаУслугИсточник);
    КонецЦикла;
КонецПроцедуры
#КонецОбласти // ЗаполнениеНаОсновании

#Область КонтрольОстатков
// Выполняет проверку достаточности остатков по Номенклатуре.
// В случае отсутствия достаточного количества остатков - оповещает Пользователя.
// Параметры:
//	количествоВДокументе - Число - Количество Номенклатуры в документе для движения
//	остаток - Число - Остаток Номенклатуры на складах
//	наименованиеНоменклатуры - Строка - Наименование Номенклатуры, используется в тексте сообщения
// Возвращаемое значение:
//	Булево - Истина если остатков нехватает, иначе Ложь
Функция проверитьПревышениеОстатков(Знач количествоВДокументе, Знач остаток, Знач наименованиеНоменклатуры)
    превышениеОстатковНоменклатуры = количествоВДокументе - остаток;
    Если превышениеОстатковНоменклатуры > 0 Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = СтрШаблон("Превышение остатка по номенклатуре: ""%1"" в количестве: ""%2""",
                наименованиеНоменклатуры, превышениеОстатковНоменклатуры);
        сообщение.Сообщить();
        Возврат Истина;
    КонецЕсли;
    Возврат Ложь;
КонецФункции

// Параметры:
//	превышениеОстатков - Число - Количество превышения остатков
//	наименованиеНоменклатуры - Строка, Неопределено - Наименование Номенклатуры, используется в тексте сообщения
//	записьКлиентаПредставление - Строка, Неопределено - Строковое представление записи клиента
Процедура сообщитьПользователюОПревышенииОстатков(
        Знач превышениеОстатков, Знач наименованиеНоменклатуры = Неопределено, Знач записьКлиентаПредставление = Неопределено)
    ДиагностикаКлиентСервер.Утверждение(наименованиеНоменклатуры <> Неопределено
        ИЛИ записьКлиентаПредставление <> Неопределено,
        "Один из необязательных аргументов: [НаименованиеНоменклатуры, ЗаписьКлиентаПредставление] должен быть заполнен.");

    форматФинансовыхДанных = "ЧДЦ=2; ЧРГ= ; ЧН=0.00";
    сообщение = Новый СообщениеПользователю;
    текстСообщения = "";
    Если записьКлиентаПредставление <> Неопределено Тогда // Это превышение суммы по записи клиента
        текстСообщения = СтрШаблон("Превышена сумма по записи клиента ""%1"" на ""%2"".",
                записьКлиентаПредставление, Формат(превышениеОстатков, форматФинансовыхДанных));
    Иначе
        текстСообщения = СтрШаблон("Превышение остатка по номенклатуре: ""%1"" в количестве: ""%2""",
                наименованиеНоменклатуры, превышениеОстатков);
    КонецЕсли;

    сообщение.Текст = текстСообщения;
    сообщение.Сообщить();
КонецПроцедуры
#КонецОбласти // КонтрольОстатков

#Область ЗапросыДанных
// Получает выборку Номенклатуры текущего документа и остатки на складе по товарам
// Параметры:
//  менеджерТаблиц - МенеджерВременныхТаблиц, Неопределено
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса
Функция получитьТоварыДокументаИОстатки(Знач менеджерТаблиц)
    менеджерТаблиц = ?(менеджерТаблиц = Неопределено, Новый МенеджерВременныхТаблиц, менеджерТаблиц);

    менеджерТаблиц = Документы.Реализация.ПолучитьТоварыДокумента(ЭтотОбъект.Ссылка, , менеджерТаблиц);
    периодДокумента = Новый Граница(ЭтотОбъект.МоментВремени());
    Возврат Документы.Реализация.ПолучитьОстаткиИСтатьиЗатратДляВТ(менеджерТаблиц, периодДокумента, ЭтотОбъект.Склад, Ложь);
КонецФункции

// Получает выборку Номенклатуры текущего документа на складе по услуги
// Возвращаемое значение:
//  - ТаблицаЗначений
Функция получитьУслугиДокумента()
    менеджерТаблиц = Документы.Реализация.ПолучитьУслугиДокумента(ЭтотОбъект.Ссылка, , Новый МенеджерВременныхТаблиц);

    запрос = Новый Запрос;
    запрос.МенеджерВременныхТаблиц = менеджерТаблиц;
    запрос.Текст =
        "ВЫБРАТЬ
        |	ВТ_УслугиДокумента.Номенклатура КАК Номенклатура,
        |	ВТ_УслугиДокумента.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
        |	ВТ_УслугиДокумента.Количество КАК Количество,
        |	ВТ_УслугиДокумента.Сумма КАК Сумма
        |ИЗ
        |   ВТ_УслугиДокумента КАК ВТ_УслугиДокумента
        |";

    результатЗапроса = запрос.Выполнить();
    Возврат результатЗапроса.Выгрузить();
КонецФункции

Функция получитьБлокировкуИзмененияТоварыНаСкладах()
    блокировка = Новый БлокировкаДанных;
    элементБлокировки = блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
    элементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
    элементБлокировки.ИсточникДанных = ЭтотОбъект.Товары;
    элементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");

    Если ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
        элементБлокировки.УстановитьЗначение("Склад", ЭтотОбъект.Склад);
    КонецЕсли;

    Возврат блокировка;
КонецФункции
#КонецОбласти // ЗапросыДанных

// Устарела. Не используется в текущей реализации
Функция получитьУчетнуюПолитику()
    Возврат РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(ЭтотОбъект.Дата).СпособУчетаЗапасов;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
