#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Знач данныеЗаполнения, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;

    Если ТипЗнч(данныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
        заполнитьНаОснованииДокументаЗакаНаряд(данныеЗаполнения);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Процедура заполнитьНаОснованииДокументаЗакаНаряд(Знач документСсылка)
    ДиагностикаКлиентСервер.Утверждение(ТипЗнч(документСсылка) = Тип("ДокументСсылка.ЗаказНаряд"));
    ДиагностикаКлиентСервер.Утверждение(ЗначениеЗаполнено(документСсылка),
        "Для заполнения на основании документ должен иметь не пустую ссылку.");

    ЭтотОбъект.ДокументОснование = документСсылка;
    ЭтотОбъект.Контрагент = документСсылка.Клиент;
    ЭтотОбъект.Автомобиль = документСсылка.Автомобиль;
    ЭтотОбъект.Сотрудник = документСсылка.Сотрудник;
    ЭтотОбъект.Комментарий = документСсылка.Комментарий;
    ЭтотОбъект.СуммаДокумента = документСсылка.СуммаДокумента;

    // Заполнение ТЧ Услуги
    ДиагностикаКлиентСервер.Утверждение(ЭтотОбъект.Услуги.Количество() = 0,
            "Таблица Услуги должна быть пустой");
    копироватьТЧ(ЭтотОбъект.Услуги, документСсылка.Услуги);

    // Заполнение ТЧ МатериалыЗаказчика
    ДиагностикаКлиентСервер.Утверждение(ЭтотОбъект.МатериалыЗаказчика.Количество() = 0,
            "Таблица МатериалыЗаказчика должна быть пустой");
    копироватьТЧ(ЭтотОбъект.МатериалыЗаказчика, документСсылка.МатериалыЗаказчика);

КонецПроцедуры

Процедура копироватьТЧ(Знач таблицаПриемник, Знач таблицаИсточник)
    Для Каждого строкаУслугИсточник Из таблицаИсточник Цикл
        новаяСтрокаУслуг = таблицаПриемник.Добавить();
        ЗаполнитьЗначенияСвойств(новаяСтрокаУслуг, строкаУслугИсточник);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
