#Область ПрограммныйИнтерфейс

// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
//  списокКлючей - Массив, ФиксированныйМассив, Строка, Структура, ФиксированнаяСтруктура
// Возвращаемое значение:
//  - Булево
Функция СтруктураСодержитКлючи(Знач объект, Знач списокКлючей) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"" | ""Строка"".");

    Если ТипЗнч(списокКлючей) = Тип("Строка") Тогда
        списокКлючей = Новый ФиксированныйМассив(СтрРазделить(списокКлючей, ",", Ложь));
    ИначеЕсли ПроверкаТиповКлиентСервер.ЭтоСтруктура(списокКлючей, Ложь) Тогда
        списокКлючей = Новый ФиксированныйМассив(ПолучитьКлючиСтруктуры(списокКлючей));
    КонецЕсли;

    Для Каждого имяСвойства Из списокКлючей Цикл
        Если НЕ объект.Свойство(имяСвойства) Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;

    Возврат объект.Количество() > 0 И списокКлючей.Количество() > 0;
КонецФункции

// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
// Возвращаемое значение:
//  - Массив
Функция ПолучитьКлючиСтруктуры(Знач объект) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"".");

    результат = Новый Массив(объект.Количество());
    сч = 0;
    Для Каждого элемент Из объект Цикл
        результат.Вставить(сч, элемент.Ключ);
        сч = сч + 1;
    КонецЦикла;

    Возврат результат;
КонецФункции

// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
// Возвращаемое значение:
//  - Массив
Функция ПолучитьЗначенияСтруктуры(Знач объект) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"".");

    результат = Новый Массив(объект.Количество());
    сч = 0;
    Для Каждого элемент Из объект Цикл
        результат.Вставить(сч, элемент.Значение);
        сч = сч + 1;
    КонецЦикла;

    Возврат результат;
КонецФункции

// Возвращает значение для указанного **ключа** если ключ существует в структуре,
//  иначе - если **вставитьКлюч** = Истина вставляет указанный **ключ** со значением **поУмолчанию**.
//  и возвращает значение **поУмолчанию**.
// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
//  ключ - Строка
//  поУмолчанию - Произвольный - Указанное значение будет возвращено если ключ отсутствует в структуре
//  вставитьКлюч - Булево - Если Истина то в случае отсутствия ключ будет вставлен в структуру (только для типа **объекта** - *Структура*)
// Возвращаемое значение:
//  - Произвольный, Неопределено
Функция ПолучитьЗначениеСтруктуры(Знач объект, Знач ключ, Знач поУмолчанию = Неопределено, Знач вставитьКлюч = Ложь) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"".");

    результат = Неопределено;
    ключСуществует = объект.Свойство(ключ, результат);

    Если ключСуществует = Ложь Тогда
        результат = поУмолчанию;
        Если вставитьКлюч Тогда
            объект.Вставить(ключ, результат);
        КонецЕсли;
    КонецЕсли;

    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
