#Область ПрограммныйИнтерфейс

// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
//  списокКлючей - Массив, ФиксированныйМассив, Строка, Структура, ФиксированнаяСтруктура
// Возвращаемое значение:
//  - Булево
Функция СтруктураСодержитКлючи(Знач объект, Знач списокКлючей) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"" | ""Строка"".");

    Если ТипЗнч(списокКлючей) = Тип("Строка") Тогда
        списокКлючей = Новый ФиксированныйМассив(СтрРазделить(списокКлючей, ",", Ложь));
    ИначеЕсли ПроверкаТиповКлиентСервер.ЭтоСтруктура(списокКлючей, Ложь) Тогда
        списокКлючей = Новый ФиксированныйМассив(ПолучитьКлючиСтруктуры(списокКлючей));
    КонецЕсли;

    Для Каждого имяСвойства Из списокКлючей Цикл
        Если НЕ объект.Свойство(имяСвойства) Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;

    Возврат объект.Количество() > 0 И списокКлючей.Количество() > 0;
КонецФункции

// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
// Возвращаемое значение:
//  - Массив
Функция ПолучитьКлючиСтруктуры(Знач объект) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"".");

    результат = Новый Массив(объект.Количество());
    сч = 0;
    Для Каждого элемент Из объект Цикл
        результат.Вставить(сч, элемент.Ключ);
        сч = сч + 1;
    КонецЦикла;

    Возврат результат;
КонецФункции

// Параметры:
//  объект - Структура, ФиксированнаяСтруктура
// Возвращаемое значение:
//  - Массив
Функция ПолучитьЗначенияСтруктуры(Знач объект) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоСтруктура(объект, Ложь),
        "Аргумент ""Объект"" должен иметь тип значения: ""Структура"" | ""ФиксированнаяСтруктура"".");

    результат = Новый Массив(объект.Количество());
    сч = 0;
    Для Каждого элемент Из объект Цикл
        результат.Вставить(сч, элемент.Значение);
        сч = сч + 1;
    КонецЦикла;

    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс