#Область ПрограммныйИнтерфейс

// Параметры:
//  счет - ПланСчетовСсылка.Хозрасчетный
// Возвращаемое значение:
//  - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные
Функция ПолучитьВидСубконтоПоСчету(Знач счет) Экспорт
    видыСубконто = счет.ВидыСубконто;

    Если видыСубконто.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;

    Возврат видыСубконто[0].ВидСубконто;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ПомощникиПроводок
// Параметры:
//  счет - ПланСчетовСсылка.Хозрасчетный
//  субконто - РегистрБухгалтерииСубконто
//  значение - СправочникСсылка
// Возвращаемое значение:
//  - Булево
Функция ЗаполнитьСубконтоПоСчету(Знач счет, субконто, Знач значение) Экспорт
    видСубконто = ПолучитьВидСубконтоПоСчету(счет);
    Если видСубконто = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;

    субконто[видСубконто] = значение;
    Возврат Истина;
КонецФункции

// Формирует структуру аналитики бухгалтерской проводки
// Параметры:
//  описаниеДебетаСчета - Структура
//          * Счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//          * Субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
//      - Неопределено
//  описаниеКредитаСчета - Структура
//          * Счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//          * Субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
//      - Неопределено
//  содержаниеОперации - Строка, Неопределено
// Возвращаемое значение:
//  - Структура - Структура
//      * Дебет - Структура - `ОписаниеСчета`
//          ** Счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//          ** Субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
//      * Кредит - Структура - `ОписаниеСчета`
//          ** Счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//          ** Субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
//      * СодержаниеОперации - Строка, Неопределено
Функция СоздатьСтруктуруАналитикиПроводки(
        Знач описаниеДебетаСчета = Неопределено,
        Знач описаниеКредитаСчета = Неопределено,
        Знач содержаниеОперации = Неопределено) Экспорт

    // Проверка аргументов
    ДиагностикаКлиентСервер.Утверждение(описаниеДебетаСчета = Неопределено
            ИЛИ этоДопустимоеОписаниеСчета(описаниеДебетаСчета),
            "Аргумент ""ОписаниеДебетаСчета"" имеет недопустимое значение.");
    ДиагностикаКлиентСервер.Утверждение(описаниеКредитаСчета = Неопределено
            ИЛИ этоДопустимоеОписаниеСчета(описаниеКредитаСчета),
            "Аргумент ""ОписаниеКредитаСчета"" имеет недопустимое значение.");
    ДиагностикаКлиентСервер.Утверждение(содержаниеОперации = Неопределено
            ИЛИ ТипЗнч(содержаниеОперации) = Тип("Строка"),
            "Аргумент ""СодержаниеОперации"" имеет недопустимое значение.");

    описаниеДебетаСчета = ?(описаниеДебетаСчета = Неопределено, СоздатьОписаниеСчета(), описаниеДебетаСчета);
    описаниеКредитаСчета = ?(описаниеКредитаСчета = Неопределено, СоздатьОписаниеСчета(), описаниеКредитаСчета);

    структураАналитики = Новый Структура;
    структураАналитики.Вставить("Дебет", описаниеДебетаСчета);
    структураАналитики.Вставить("Кредит", описаниеКредитаСчета);
    структураАналитики.Вставить("СодержаниеОперации", содержаниеОперации);

    Возврат структураАналитики;
КонецФункции

// Параметры:
//  счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//  субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
// Возвращаемое значение:
//  - Структура
//      * Счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//      * Субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
Функция СоздатьОписаниеСчета(Знач счет = Неопределено, Знач субконто = Неопределено) Экспорт
    Возврат Новый Структура("Счет, Субконто", счет, субконто);
КонецФункции
#КонецОбласти // ПомощникиПроводок

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  описаниеСчета - Структура
//      * Счет - ПланСчетовСсылка.Хозрасчетный, Неопределено
//      * Субконто - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные, Неопределено
// Возвращаемое значение:
//  - Булево
Функция этоДопустимоеОписаниеСчета(Знач описаниеСчета)
    типОписания = ТипЗнч(описаниеСчета);
    результат = описаниеСчета <> Неопределено И типОписания = Тип("Структура");
    Если НЕ результат Тогда
        Возврат Ложь;
    КонецЕсли;

    обязательныеПоля = Новый Массив;
    обязательныеПоля.Добавить("Счет");
    обязательныеПоля.Добавить("Субконто");

    Для Каждого имяПоля Из обязательныеПоля Цикл
        результат = результат И описаниеСчета.Свойство(имяПоля);
        Если НЕ результат Тогда
            Прервать;
        КонецЕсли;
    КонецЦикла;

    Возврат результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
