#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(_, __)
    инициализацияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(_)
    Если ЭтотОбъект.Объект.Ссылка.Пустая() Тогда
        ЭтотОбъект.Объект.Родитель = ?(ЗначениеЗаполнено(ЭтотОбъект.Объект.Родитель),
                ЭтотОбъект.Объект.Родитель, ЭтотОбъект._Состояние.ГруппыНоменклатуры.Товары);
    КонецЕсли;

    установитьВидимостьПолейФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(_)
    установитьРодителя();
    установитьВидимостьПолейФормы();
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(_)
    установитьТипНоменклатуры();
    установитьВидимостьПолейФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура установитьРодителя()
    Если ЭтотОбъект.Объект.ТипНоменклатуры = ЭтотОбъект._Состояние.ТипыНоменклатуры.Товар Тогда // Это Товар
        ЭтотОбъект.Объект.Родитель = ЭтотОбъект._Состояние.ГруппыНоменклатуры.Товары;

    ИначеЕсли ЭтотОбъект.Объект.ТипНоменклатуры = ЭтотОбъект._Состояние.ТипыНоменклатуры.Материал Тогда // Это Материал
        ЭтотОбъект.Объект.Родитель = ЭтотОбъект._Состояние.ГруппыНоменклатуры.Материалы;

    ИначеЕсли ЭтотОбъект.Объект.ТипНоменклатуры = ЭтотОбъект._Состояние.ТипыНоменклатуры.МатериалКлиента Тогда // Это Материал
        ЭтотОбъект.Объект.Родитель = ЭтотОбъект._Состояние.ГруппыНоменклатуры.МатериалыКлиента;

    ИначеЕсли ЭтотОбъект.Объект.ТипНоменклатуры = ЭтотОбъект._Состояние.ТипыНоменклатуры.Услуга Тогда // Это Услуга
        ЭтотОбъект.Объект.Родитель = ЭтотОбъект._Состояние.ГруппыНоменклатуры.Услуги;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура установитьТипНоменклатуры()
    Если ЭтотОбъект.Объект.Родитель.Пустая() Тогда
        Возврат;
    КонецЕсли;

    типНоменклатурыДляГруппы = ЭтотОбъект._Состояние.КартаСоответствияГруппНоменклатур.Получить(ЭтотОбъект.Объект.Родитель);
    ДиагностикаКлиентСервер.Утверждение(типНоменклатурыДляГруппы <> Неопределено,
        "Тип номенклатуры для группы должен быть определен.");

    ЭтотОбъект.Объект.ТипНоменклатуры = типНоменклатурыДляГруппы;
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимостьПолейФормы()
    ЭтотОбъект.Элементы.ДлительностьУслуги.Видимость =
        ЭтотОбъект.Объект.ТипНоменклатуры = ЭтотОбъект._Состояние.ТипыНоменклатуры.Услуга;
    настройкаОтображенияПредупрежденийДляНезаполненныхПолей();
КонецПроцедуры

&НаКлиенте
Функция получитьКонтекстДиагностики(Знач имяФункции = Неопределено)
    базовыйКонтекстДиагностики = "Номенклатура.ФормаЭлемента";
    Возврат ?(имяФункции = Неопределено, базовыйКонтекстДиагностики, СтрШаблон("%1.%2", базовыйКонтекстДиагностики, имяФункции));
КонецФункции

// Настроика включения/отключения отметки незаполненного для опциональных полей
&НаКлиенте
Процедура настройкаОтображенияПредупрежденийДляНезаполненныхПолей()
    Если ЗначениеЗаполнено(ЭтотОбъект.Объект.ТипНоменклатуры)
        И ЭтотОбъект.Объект.ТипНоменклатуры <> ЭтотОбъект._Состояние.ТипыНоменклатуры.МатериалКлиента Тогда
        ЭтотОбъект.Элементы.СтатьяЗатрат.АвтоОтметкаНезаполненного = Истина;
    Иначе
        ЭтотОбъект.Элементы.СтатьяЗатрат.АвтоОтметкаНезаполненного = Ложь;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область Инициализация

&НаСервере
Процедура инициализацияНаСервере()
    ЭтотОбъект._Состояние = Новый Структура("ГруппыНоменклатуры, ТипыНоменклатуры, КартаСоответствияГруппНоменклатур");
    ЭтотОбъект._Состояние.ГруппыНоменклатуры = РаботаСМетаданными.ПолучитьЗначенияПредопределенных(Тип("СправочникСсылка.Номенклатура"));
    ЭтотОбъект._Состояние.ТипыНоменклатуры = Справочники.Номенклатура.ПолучитьТипыНоменклатуры();
    ЭтотОбъект._Состояние.КартаСоответствияГруппНоменклатур = Справочники.Номенклатура.ПолучитьКартуГруппВТипыНоменклатуры();
КонецПроцедуры

#КонецОбласти // Инициализация
