#Область ОбработчикиКомандФормы

// Создает и записывает новый документ УстановкаЦенПоставщика.
//  После создания документа выполняется закрытие формы загрузчика
//  прайс-листа и открывается форма созданного документа.
// Параметры:
//  _ - Неопределено - [Команда] - Не используется
&НаКлиенте
Процедура СоздатьИзПрайсЛиста(_)
    открытьФормуЗагрузкиПрайсЛиста();
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция открытьФормуЗагрузкиПрайсЛиста()
    форма = ОткрытьФорму(
            "Обработка.ЗагрузкаПрайсЛиста.Форма", ,
            ЭтотОбъект, , , , ,
            РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

    Возврат форма;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
