#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(_)
	обновитьСуммуПоСтрокеТовары();
    обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(_)
    обновитьСуммуПоСтрокеТовары();
    обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(_)
	обновитьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(_)
    обновитьСуммуПоСтрокеУслуги();
    обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(_)
    обновитьСуммуПоСтрокеУслуги();
    обновитьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(_)
	обновитьСуммуДокумента();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыУслуги

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура обновитьСуммуПоСтрокеТовары()
    текущСтрокаТовары = ЭтотОбъект.Элементы.Товары.ТекущиеДанные;
    текущСтрокаТовары.Сумма = текущСтрокаТовары.Цена * текущСтрокаТовары.Количество;
КонецПроцедуры

&НаКлиенте
Процедура обновитьСуммуПоСтрокеУслуги()
    текущСтрокаУслуги = ЭтотОбъект.Элементы.Услуги.ТекущиеДанные;
    текущСтрокаУслуги.Сумма = текущСтрокаУслуги.Цена * текущСтрокаУслуги.Количество;
КонецПроцедуры

&НаКлиенте
Процедура обновитьСуммуДокумента()
    ЭтотОбъект.Объект.СуммаДокумента = ЭтотОбъект.Объект.Товары.Итог("Сумма") + ЭтотОбъект.Объект.Услуги.Итог("Сумма");
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
