#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
    настроитьВидФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура настроитьВидФормы()
    этоСтандартныйВидРасчета = получитьЭтоСтандартныйВидРасчетаНаСервере(ЭтотОбъект.Объект.Ссылка);
    настроитьДоступностьПолей(этоСтандартныйВидРасчета);

    Если этоСтандартныйВидРасчета Тогда
        ЭтотОбъект.Элементы.Страницы.ТекущаяСтраница = ЭтотОбъект.Элементы.Страницы.ПодчиненныеЭлементы.ГруппаБазовыеВидыРасчета;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура настроитьДоступностьПолей(Знач этоСтандартныйВидРасчета)
    ЭтотОбъект.Элементы.Наименование.ТолькоПросмотр = этоСтандартныйВидРасчета = Истина;
    ЭтотОбъект.Элементы.ГруппаФормулаРасчета.Доступность = НЕ этоСтандартныйВидРасчета;
    ЭтотОбъект.Элементы.ГруппаФормулаРасчета.Доступность = НЕ этоСтандартныйВидРасчета;
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьЭтоСтандартныйВидРасчетаНаСервере(Знач ссылка)
    Возврат ПланыВидовРасчета.Начисления.ЭтоСтандартныйВидРасчета(ссылка);
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
