#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    Если проверитьЗаполнениеПоляВладелец() = Ложь Тогда
        РаботаСРеквизитами.ИсключитьПроверенныйРеквизит("Владелец", проверяемыеРеквизиты);
        отказ = Истина;
        Возврат;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  - Булево
Функция проверитьЗаполнениеПоляВладелец()
    ДиагностикаКлиентСервер.Утверждение(ТипЗнч(ЭтотОбъект.Владелец) = Тип("СправочникСсылка.Контрагенты"),
    "Тип Владельца должен быть - ""СправочникСсылка.Контрагенты"".");

	Если ЗначениеЗаполнено(ЭтотОбъект.Владелец) Тогда
        Если ЭтотОбъект.Владелец.ТипКонтрагента <> Перечисления.ТипыКонтрагентов.Покупатель Тогда
            сообщение = Новый СообщениеПользователю;
            сообщение.Текст = "Владельцем автомобиля должен быть Клиент (Контрагент с Типом: ""Покупатель"".)";
            сообщение.Поле = "Владелец";
            сообщение.УстановитьДанные(ЭтотОбъект);
            сообщение.Сообщить();

            Возврат Ложь;
        КонецЕсли;
    КонецЕсли;

    Возврат Истина;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
