#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - ФиксированнаяСтруктура
Функция ПолучитьЗначенияПланаСчетов() Экспорт
    результат = РаботаСМетаданными.ПолучитьЗначенияПредопределенных(Тип("ПланСчетовСсылка.Хозрасчетный"));
    ДиагностикаКлиентСервер.Утверждение(результат <> Неопределено,
        "Ошибка получения предопределенных значений ""ПланаСчетов.Хозрасчетный""",
        "ПланыСчетов.Менеджер.Хозрасчетный.ПолучитьЗначенияПлановСчетов");

    Возврат результат;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
