#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - МенеджерВременныхТаблиц
Функция СоздатьВТ(Знач таблица, Знач имяТаблицы, Знач менеджер = Неопределено) Экспорт
    запрос = Новый Запрос;
    запрос.МенеджерВременныхТаблиц = ?(менеджер = Неопределено, Новый МенеджерВременныхТаблиц, менеджер);
    запрос.Текст =
        "ВЫБРАТЬ
        |   *
        |ПОМЕСТИТЬ ВТ_НоваяТаблица
        |ИЗ
        |   &Таблица
        |";
    запрос.УстановитьПараметр("&Таблица", таблица);
    запрос.Текст = СтрЗаменить(запрос.Текст, "ВТ_НоваяТаблица", имяТаблицы);
    запрос.Выполнить();

    Возврат запрос.МенеджерВременныхТаблиц;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
